# Homebrew Formulae (Command-line tools)
brew "abseil"
brew "aircrack-ng"
brew "amass"
brew "aom"
brew "apktool"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aribb24"
brew "autoconf"
brew "berkeley-db@5"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "certifi"
brew "cjson"
brew "cmatrix"
brew "curl"
brew "dav1d"
brew "dex2jar"
brew "exiftool"
brew "feroxbuster"
brew "ffmpeg"
brew "ffuf"
brew "flac"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "gd"
brew "gdbm"
brew "gettext"
brew "gf"
brew "giflib"
brew "glib"
brew "gmp"
brew "gnutls"
brew "go"
brew "gobuster"
brew "graphite2"
brew "harfbuzz"
brew "hashcat"
brew "highway"
brew "httpx"
brew "hydra"
brew "icu4c@77"
brew "imath"
brew "ios-deploy"
brew "jadx"
brew "john"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "json-c"
brew "judy"
brew "krb5"
brew "lame"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libavif"
brew "libb2"
brew "libbluray"
brew "libdeflate"
brew "libdnet"
brew "libevent"
brew "libgit2"
brew "libidn2"
brew "liblinear"
brew "libmicrohttpd"
brew "libnghttp2"
brew "libogg"
brew "libpcap"
brew "libpng"
brew "libpq"
brew "librist"
brew "libsamplerate"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libunibreak"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libwebsockets"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxcrypt"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "llvm"
brew "lmdb"
brew "lua"
brew "lz4"
brew "lzo"
brew "m4"
brew "mariadb-connector-c"
brew "masscan"
brew "mbedtls"
brew "minizip"
brew "mpdecimal"
brew "mpg123"
brew "net-snmp"
brew "netcat"
brew "nettle"
brew "nikto"
brew "nmap"
brew "node"
brew "nuclei"
brew "nvm"
brew "oniguruma"
brew "opencore-amr"
brew "openexr"
brew "openjdk"
brew "openjdk@21"
brew "openjpeg"
brew "openldap"
brew "openssl@3"
brew "openvpn"
brew "opus"
brew "p11-kit"
brew "pango"
brew "pcre"
brew "pcre2"
brew "perl"
brew "php"
brew "pidcat"
brew "pipx"
brew "pixman"
brew "pkcs11-helper"
brew "pkgconf"
brew "popt"
brew "protobuf"
brew "protobuf-c"
brew "pyenv"
brew "python@3.13"
brew "rav1e"
brew "readline"
brew "rtmpdump"
brew "rubberband"
brew "rust"
brew "samba"
brew "scrcpy"
brew "sdl2"
brew "snappy"
brew "socat"
brew "speex"
brew "spoof-mac"
brew "sqlite"
brew "sqlmap"
brew "srt"
brew "sslscan"
brew "subfinder"
brew "svt-av1"
brew "talloc"
brew "tdb"
brew "telnet"
brew "tesseract"
brew "tevent"
brew "theharvester"
brew "theora"
brew "tidy-html5"
brew "unbound"
brew "unixodbc"
brew "webp"
brew "wget"
brew "whois"
brew "x264"
brew "x265"
brew "xorgproto"
brew "xvid"
brew "xxhash"
brew "xz"
brew "yarn"
brew "z3"
brew "zeromq"
brew "zimg"
brew "zmap"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zstd"

# Homebrew Casks (GUI Applications)
cask "android-platform-tools"
cask "ghidra"
cask "metasploit"
cask "mitmproxy"
cask "wireshark"
